<html>
<head>
<title>sockets - internet samples</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body bgcolor="#FFFFFF">
<h1><font color="#0000FF">Sockets Samples</font></h1>
<p>Two things are required to run any sockets program from Prolog:</p>
<ol>
  <li>Load asock.lsx. One way is to include lsxload = asock in the amzi.cfg file.</li>
  <li>Load asock.plm. This can be done with a load(asock) goal in a Prolog program, 
    or it can be done by linking the library asock.plm with a compiled Prolog 
    program.</li>
</ol>
<p>The samples:</p>
<h2>Finger Sample</h2>
<p>The simplest program <a href="https://en.wikipedia.org/wiki/Finger_protocol">fingers a host</a>. If you are running under Unix you will 
  need to change the sdefine/2 declaration at the top and comment out the Windows 
  calls (wsaStartup and wsaCleanup).</p>
<p> To run it from the listener:</p>
<blockquote>
  <pre><font color="#000033">?- load(asock).
yes
?- consult(finger).
yes
?- main.
Host name to finger? <font color="#555555">%enter the host name -- try <font color="#000000"><b>telehack.com</b></font></font>
...
User name? <font color="#555555">%enter the user name -- try <font color="#000000"><b>operator</b></font></font>
</font>
</pre>
</blockquote>
<p><b>Note:</b> Only very few public servers still provide the finger service/daemon for security and privacy reasons. The host and user names mentioned in the comments above are from a game simulation (telehack) and should work. You can also find <a href="https://superuser.com/a/1590631">a list of servers that support finger</a> under the section "Practical use" in the linked page.</p>
<p>You should see the host's IP address as a response to the entered host name, and then a request for providing a user name. If you have a valid one, you should see some status information about that entered user name, such as last login time or user rights/status bits.</p>

<p>
Exemplary response for the host <b>telehack.com</b> and the user <b>operator</b>:</p>
<pre>
USER: operator
   status message:        System Operator
   system level:          12 (OPERATOR)
   location:              tty
   first login:           11.2y
   last active:           5m
   days active:           4087
   system connects:       5
   commands executed:     4
   legacy logincounts:    1, 1, 103

   operator has LOGIN on 26 systems

   user status bits:
     SHEEP          Baa                     2021-Feb-25  17:14:04
     LATENITE       Go to sleep             2020-Sep-04  15:25:51
     DECIMAL        3650                    2020-Mar-04  20:26:00
     UUBOT          Administrate            2019-Aug-21  22:58:41
     PERMUSER       Permanent User          2019-Aug-21  17:10:42
     FOUNDER        1000 days               2019-Aug-21  17:10:42
     REGUSER        Regular User            2019-Aug-21  17:10:42
     RETUSER        Returned User           2019-Aug-21  17:10:42
     OCTAL          5550                    2018-Mar-05  20:26:00
     QUATERNARY     112310                  2014-Mar-06  20:26:00
     BINARY         1011011010              2012-Mar-06  20:26:00
     OPER           System Operator         2010-Mar-07  20:26:00

No plan.
</pre>

<h2>Client/Server Sample</h2>
<p>A simple client/server example, where the clients send lines of text to the 
  server, which echos the text. It can be run on one machine or multiple ones. 
  If you are running under Unix you will need to change the sdefine/2 declaration 
  at the top and comment out the Windows calls (wsaStartup and wsaCleanup). </p>
<p>To run on a single machine, open two consoles and run alis in each.</p>
<h3>Server</h3>
<blockquote>
  <pre><font color="#000033">?- load(asock).
yes
?- consult(sserver).
yes
?- main.</font>
</pre>
</blockquote>
<h3>Client</h3>
<blockquote>
  <pre><font color="#000033">?- load(asock).
yes
?- consult(sclient).
yes
?- main.
Send what? hello
yes
?-</font>
</pre>
</blockquote>
<p>The server should then echo the 'hello'. From the client, type main again and 
  send the string 'shutdown' to shut down the server. Or you can just crtl-C/break 
  out of the server.<br>
</p>
<p><br>
</p>
</body>
</html>
